<template>
  <v-app id="app">
    <v-row justify="center">
      <v-dialog v-model="dialog" persistent max-width="600px">
        <template v-slot:activator="{ on }">
          <v-btn color="primary" dark v-on="on">
            資質を入力してください。
          </v-btn>
        </template>
        <v-card>
          <v-card-title>
            <span class="headline">資質</span>
          </v-card-title>
          <v-card-text>
            <v-container>
              <v-row>
                <v-col cols="12" sm="7">
                  <v-select :items="[ 'アレンジ', '運命思考', '回復志向', '学習欲', '活発性', '共感性', '競争性', '規律性', '原点思考', '公平性', '個別化', ' コミュニケーション', '最上志向', '自我', '自己確信', '社交性', '収集心', '指令性', '慎重さ', '信念', '親密性', '成長促進', '責任感', '戦略性', '達成欲', '着想', '調和性', '適応性', '内省', '分析思考', '包含', 'ポジティブ', '未来志向', '目標志向' ]" label="上位1番目の資質を選択して下さい。" multiple />
                </v-col>
                <v-col cols="12" sm="7">
                  <v-select :items="[ 'アレンジ', '運命思考', '回復志向', '学習欲', '活発性', '共感性', '競争性', '規律性', '原点思考', '公平性', '個別化', ' コミュニケーション', '最上志向', '自我', '自己確信', '社交性', '収集心', '指令性', '慎重さ', '信念', '親密性', '成長促進', '責任感', '戦略性', '達成欲', '着想', '調和性', '適応性', '内省', '分析思考', '包含', 'ポジティブ', '未来志向', '目標志向' ]" label="上位2番目の資質を選択して下さい。" multiple />
                </v-col>
                <v-col cols="12" sm="7">
                  <v-select :items="[ 'アレンジ', '運命思考', '回復志向', '学習欲', '活発性', '共感性', '競争性', '規律性', '原点思考', '公平性', '個別化', ' コミュニケーション', '最上志向', '自我', '自己確信', '社交性', '収集心', '指令性', '慎重さ', '信念', '親密性', '成長促進', '責任感', '戦略性', '達成欲', '着想', '調和性', '適応性', '内省', '分析思考', '包含', 'ポジティブ', '未来志向', '目標志向' ]" label="上位3番目の資質を選択して下さい。" multiple />
                </v-col>
                <v-col cols="12" sm="7">
                  <v-select :items="[ 'アレンジ', '運命思考', '回復志向', '学習欲', '活発性', '共感性', '競争性', '規律性', '原点思考', '公平性', '個別化', ' コミュニケーション', '最上志向', '自我', '自己確信', '社交性', '収集心', '指令性', '慎重さ', '信念', '親密性', '成長促進', '責任感', '戦略性', '達成欲', '着想', '調和性', '適応性', '内省', '分析思考', '包含', 'ポジティブ', '未来志向', '目標志向' ]" label="上位4番目の資質を選択して下さい。" multiple />
                </v-col>
                <v-col cols="12" sm="7">
                  <v-select :items="[ 'アレンジ', '運命思考', '回復志向', '学習欲', '活発性', '共感性', '競争性', '規律性', '原点思考', '公平性', '個別化', ' コミュニケーション', '最上志向', '自我', '自己確信', '社交性', '収集心', '指令性', '慎重さ', '信念', '親密性', '成長促進', '責任感', '戦略性', '達成欲', '着想', '調和性', '適応性', '内省', '分析思考', '包含', 'ポジティブ', '未来志向', '目標志向' ]" label="上位5番目の資質を選択して下さい。" multiple />
                </v-col>
              </v-row>
            </v-container>
            <small>*入力必須項目です。</small>
          </v-card-text>
          <v-card-actions>
            <v-spacer />
            <v-btn color="blue darken-1" text @click="dialog = false">
              Close
            </v-btn>
            <v-btn color="blue darken-1" text @click="dialog = false">
              Save
            </v-btn>
          </v-card-actions>
        </v-card>
      </v-dialog>
    </v-row>
  </v-app>
</template>

<script>
export default {
  data: () => ({
    dialog: false
  })
}
</script>
